{
  "personal_data": {
    "name": {
      "first": "Rukmal",
      "middle": "Manish",
      "last": "Weerawarana"
    },
    "address": {
      "street": "238 W 20th Street Apt 4C",
      "city": "New York",
      "state": "NY",
      "zip": "10011-3518",
      "zip_short": "10011",
      "country": "USA"
    },
    "citizenship": [
      "United States",
      "Sri Lanka"
    ],
    "email": "rukmal.weerawarana@gmail.com",
    "homepage": "http://rukmal.me/",
    "phone": "+1 (206) 839-6891"
  },
  "education": {
    "stevens": {
      "name": "Stevens Institute of Technology",
      "location": "Hoboken, NJ",
      "date_from": "2017-08",
      "date_to": "2019-05",
      "degrees": [
        {
          "title": "Master of Science",
          "degree_abv": "MS",
          "major": "Financial Engineering",
          "full_degree": "Master of Science in Financial Engineering",
          "school": "School of Business",
          "department": "",
          "GPA": "3.7"
        }
      ],
      "awards": [
        "Provost Master's Fellowship"
      ]
    },
    "uw": {
      "name": "University of Washington",
      "location": "Seattle, WA",
      "date_from": "2013-09",
      "date_to": "2017-06",
      "degrees": [
        {
          "title": "Bachelor of Arts in Business Administration",
          "degree_abv": "BABA",
          "major": "Finance and Business Economics",
          "full_degree": "Bachelor of Arts in Business Administration (Finance)",
          "school": "Michael G. Foster School of Business",
          "department": "Department of Finance and Business Economics"
        },
        {
          "title": "Certificate in the Quantitative Fundamentals of Computational Finance",
          "degree_abv": "QFCF Certificate",
          "major": "Quantitative Fundamentals of Computational Finance",
          "full_degree": "Certificate in the Quantitative Fundamentals of Computational Finance",
          "school": "College of Arts & Sciences",
          "department": "Department of Applied Mathematics"
        }
      ]
    },
    "bsc": {
      "name": "The British School in Colombo",
      "location": "Colombo, Sri Lanka",
      "date_from": "2009-08",
      "date_to": "2013-07",
      "degrees": [
        {
          "title": "International Baccalaureate Diploma",
          "degree_abv": "IB",
          "major": "Higher Level Mathematics, Physics, and Chemistry",
          "full_degree": "International Baccalaureate Diploma",
          "school": "International Baccalaureate Organization",
          "department": "Diploma Programme"
        }
      ]
    }
  },
  "work_experience": {
    "stevens_smc": {
      "company_name": "Sensorimotor Control Laboratory",
      "company_extra": "Stevens Institute of Technology; Department of Biomedical Engineering",
      "location": "Hoboken, NJ",
      "titles": [
        {
          "title": "Research Assistant",
          "date_from": "2018-08",
          "date_to": ""
        }
      ],
      "description": [
        "Designed and implemented algorithms to assess and classify tremor severity in patients with late-stage Parkinson’s Disease.",
        "Provided input to hardware research based on statistical tremor analysis results with the goal of designing a complete low-cost system for tremor analysis. Contributed to additive manufacturing models and designing sensor arrays for a data collection glove to be used for tremor analysis.",
        "Created a web-based deployment architecture for the tremor analysis engine, including HIPAA-compliant data storage and access, and efficient cluster management with Docker and Kubernetes.",
        "Performed cost comparisons to identify the most economical Infrastructure-as-a-Service (IaaS) provider, given the storage and computation requirements of the solution stack."
      ]
    },
    "rpi_ibm": {
      "company_name": "IBM HEALS Research Center",
      "company_extra": "Department of Computer Science; Rensselaer Polytechnic Institute",
      "location": "Troy, NY",
      "titles": [
        {
          "title": "Summer Research Assistant",
          "date_from": "2018-05",
          "date_to": "2018-08"
        }
      ],
      "description": [
        "Contributed to significant novel research in Artificial Intelligence - specifically in the space of Knowledge Representation (KR), as a part of the Health Empowerment by Analytics, Learning and Semantics (HEALS) Team in the Computer Science Department. The HEALS Project is a member of the IBM Research AI Horizons Network.",
        "Formulated strategies for semantically-enhanced extraction of medical directives from various Clinical Practice Guidelines (CPGs), for eventual inclusion in a knowledge graph of Diabetes diagnosis and treatment directives. Built the Guideline Explorer, a tool for efficiently visualizing and examining the American Diabetes Association’s 2018 Clinical Practice Guidelines.",
        "Developed the Guideline Analysis Framework; a mathematical formulation of CPGs that may be used to compare various CPGs addressing the same group of ailments, and to aid in the identification of potential disparities in the medical directives.",
        "Formulated an Electronic Health Record (EHR) simulation engine, which utilized Monte Carlo simulations based on a population heuristic to vary idiosyncratic patient attributes, creating a statistical prediction of medical tests to be conducted that are likely to identify previously-unknown medical conditions.",
        "Explored the field of Semantalytics, which is the intersection of Semantics and Analytics, with each informing the other in a symbiotic fashion. Drafted a Vision statement for the field of Semantalytics, through the context of simulated patient data.",
        "Designed and developed the PaperRank Framework, a methodology for deriving a probabilistic community trust score for academic publications utilizing the popular PageRank algorithm, coupled with a Gamma Mixture Model applied to entire academic citation graphs. Implemented a complete proof-of-concept from extraction to final trust computation with the NCBI PubMed Database, analyzing over 14 Million academic publications."
      ]
    },
    "stevens_hanlon": {
      "company_name": "Hanlon Financial Systems Laboratory",
      "company_extra": "Stevens Institute of Technology; School of Business",
      "location": "Hoboken, NJ",
      "titles": [
        {
          "title": "Laboratory Assistant",
          "date_from": "2017-09",
          "date_to": "2018-05"
        },
        {
          "title": "Laboratory Assistant",
          "date_from": "2018-08",
          "date_to": "2018-12"
        }
      ],
      "description": [
        "Assist in the daily operations of the lab, including maintaining existing software resources.",
        "Spearheaded an effort to discover and implement new technology solutions to help facilitate the teaching and research activities of the lab."
      ]
    },
    "uw_hyperloop": {
      "company_name": "UW Hyperloop",
      "company_extra": "University of Washington; College of Engineering",
      "location": "Seattle, WA",
      "titles": [
        {
          "title": "Business Management Team Lead",
          "date_from": "2016-08",
          "date_to": "2017-09"
        },
        {
          "title": "Control Systems Team Member",
          "date_from": "2017-01",
          "date_to": "2017-07"
        },
        {
          "title": "Business Management Team Member",
          "date_from": "2016-05",
          "date_to": "2017-09"
        }
      ],
      "description": [
        "Represented the University of Washington at the inaugural SpaceX, Inc. Hyperloop Pod Competition in Hawthorne, CA. The team placed 4th in the United States, and 6th globally. The competition received 1,700 team proposals, and 30 finalists.",
        "Led the Business Management Team to develop and deploy a highly successful crowdfunding campaign to raise over $20,000 (with an initial goal of $10,000), and source materials to engineer and construct one of the first-ever functioning Hyperloop Pods. The collective effort of the team led to us having the lowest-cost Pod among the 30 finalists.",
        "Spearheaded outreach to sponsors, collaborators, internal (UW) and external advisors.",
        "Facilitated the sourcing and delivery of over $50,000 of raw material, including high-density Carbon Fiber, release agents, and powerful Neodymium magnets for the final Pod assembly.",
        "Assisted the Controls Team Lead in the final design and implementation of electronic mapping and wiring on the Pod.",
        "Contributed to late-stage troubleshooting efforts that led to the successful implementation of Halbach arrays, facilitating levitation and magnetic propulsion of the UW Pod.",
        "Explored the transformative economic and social effect a hypothetical Hyperloop system could have on the Pacific Northwest of the United States."
      ]
    },
    "uw_cubesat": {
      "company_name": "Lunar CubeSAT Team - Advanced Propulsion Laboratory",
      "company_extra": "University of Washington; Department of Earth and Space Sciences",
      "location": "Seattle, WA",
      "titles": [
        {
          "title": "Research Assistant; Avionics Team",
          "date_from": "2015-03",
          "date_to": "2015-07"
        }
      ],
      "description": [
        "Designed a communications software architecture paradigm for the on-board processing systems of the Lunar CubeSAT.",
        "Investigated the effect of radiation beyond the Van Allen belts experienced during translunar flight, and recommended ideal processor architectures and other redundant measures that may be taken to mitigate these effects.",
        "Proposed a system of Hamming coding to increase data transfer security during communications between the CubeSAT and a ground station at the University of Washington. Recommended specific data encoding algorithms to increase the data throughput of the Earth downlink from the CubeSAT.",
        "Presented final proposal to a panel of scientists at the Advanced Propulsion Laboratory and NASA. The UW Lunar CubeSAT is expected to launch as a secondary payload on NASA’s Space Launch System (SLS) aboard the Orion Spacecraft."
      ]
    },
    "zocialgpa": {
      "company_name": "ZocialGPA, Inc.",
      "company_extra": "Startup Company",
      "location": "Seattle, WA",
      "titles": [
        {
          "title": "Software Engineering Team Lead",
          "date_from": "2015-07",
          "date_to": "2016-01"
        },
        {
          "title": "Software Engineering Intern",
          "date_from": "2015-02",
          "date_to": "2015-06"
        }
      ],
      "description": [
        "Beginning as an intern, I went on to lead the full-stack team tasked with designing and implementing the full suite of ZocialGPA social analytics products.",
        "Designed a highly scalable and efficient software ETL stack, building datasets from various social networking platforms including Facebook, Twitter and LinkedIn. Created heuristics for efficient retrieval of this data from large, non-relational databases."
      ]
    },
    "wso2": {
      "company_name": "WSO2, Inc.",
      "company_extra": "Apache Stratos Team",
      "location": "Colombo, Sri Lanka",
      "titles": [
        {
          "title": "Software Engineering Intern",
          "date_from": "2014-06",
          "date_to": "2014-09"
        }
      ],
      "description": [
        "Investigated the viability of alternative hypervisor stacks for eventual integration with the Apache Stratos Platform-as-a-Service (PaaS) framework.",
        "Conducted isolated integration tests with the CoreOS+Docker (LXC-based) hypervisor stack as an alternative to the existing KVM hypervisor used in Stratos.",
        "Developed a new user interface for the Stratos Manager Console using the JaggeryJS MVC framework, which was packaged and shipped with Stratos version 4.1.0."
      ]
    },
    "mullins_lab": {
      "company_name": "Mullins Molecular Retrovirology Laboratory",
      "company_extra": "University of Washington; Department of Microbiology",
      "location": "Seattle, WA",
      "titles": [
        {
          "title": "Research Assistant; Scientific Programming",
          "date_from": "2014-04",
          "date_to": "2014-08"
        }
      ],
      "description": [
        "Assisted the Lead Scientific Programmer of the lab in identifying and extracting sequences of mutated genes in human genome sequences, aiding in the creation of targeted retroviral therapies for patients with the Human Immunodeficiency Virus (HIV).",
        "Created efficient and scalable data traversal algorithms for the ingestion and transformation of large human genome sequences. Utilized Hyperfreq, a tool for Bayesian analysis of APOBEC3G-induced hypermutations to identify sequences of the genome likely to have been mutated."
      ]
    }
  }
}
